<template>
  <div class="agreement-content">
    <img src="../img/close.png" class="close" @click="imgjumpa" />

    <h3>全名网用户注册协议</h3>
    <dl>
      <dt
        class="border-none"
      >本协议是您与全名网网站（以下简称"本站"，网址：www.quanmingwang.com）所有者陕西全名信息科技有限公司（以下简称为"全名网"）之间就 全名网网站服务等相关事宜所订立的契约，请您仔细阅读本注册协议，您点击同意按钮后，本协议即构成对双方有约束力的法律文件。</dt>
    </dl>
    <dl>
      <dt>第1条 本站服务条款的确认和接纳</dt>
      <dd>
        <p>
          1.1
          本站的各项电子服务的所有权和运作权归全名网所有。用户同意所有注册协议条款并完成注册程序，才能成为本站的正式用户。用户确认：本协议条款是处理双方权利义务的契约，始终有效，法律另有强制性规定或双方另有特别约定的，依其规定。
        </p>
        <p>
          1.2
          用户点击同意本协议的，即视为用户确认自己具有享受本站服务、下单购物等相应的权利能力和行为能力，能够独立承担法律责任。
        </p>
        <p>
          1.3
          如果您在18周岁以下，您只能在父母或监护人的监护参与下才能使用本站。
        </p>
        <p>
          1.4
          全名网保留在中华人民共和国大陆地区法施行之法律允许的范围内独自决定拒绝服务、关闭用户账户、清除或编辑内容或取消订单的权利。
        </p>
      </dd>
    </dl>
    <dl>
      <dt>第2条 本站服务</dt>
      <dd>
        <p>
          2.1
          全名网通过互联网依法为用户提供互联网信息等服务，用户在完全同意本协议及本站规定的情况下，方有权使用本站的相关服务。
        </p>
        <p>
          2.2
          用户必须自行准备如下设备和承担如下开支：（1）上网设备，包括并不限于电脑或者其他上网终端、调制解调器及其他必备的上网装置；（2）上网开支，包括并不限于网络接入费、上网设备租用费、手机流量费等。
        </p>
      </dd>
    </dl>
    <dl>
      <dt>第3条 用户信息</dt>
      <dd>
        <p>
          3.1
          用户应自行诚信向本站提供注册资料，用户同意其提供的注册资料真实、准确、完整、合法有效，用户注册资料如有变动的，应及时更新其注册资料。如果用户提供的注册资料不合法、不真实、不准确、不详尽的，用户需承担因此引起的相应责任及后果，并且全名网保留终止用户使用全名网各项服务的权利。用户信息为全名网提供相应服务之必须，您以自愿填写的方式提供注册所需的姓名、电话、头像以及其他类似的个人信息，则表示您已经了解并接受您个人信息的用途，同意全名网为实现该特定目的使用您的个人信息。除此个人信息之外，其他任何您发送或提供给全名网的材料、信息或文本(以下统称信息)均将被视为非保密和非专有的。全名网对这些信息不承担任何义务。同时如果您提交时没有特别声明的，可视为同意全名网及其授权人可以因商业或非商业的目的复制、透露、分发、合并和以其他方式利用这些信息和所有数据、图像、声音、文本及其他内容。
        </p>
        <p>
          3.2
          用户在本站进行浏览、下单购物等活动时，涉及用户真实姓名/名称、通信地址、联系电话、电子邮箱等隐私信息的，本站将予以严格保密，除非得到用户的授权或法律另有规定，本站不会向外界披露用户隐私信息。
        </p>
        <p>
          3.3
          用户注册成功后，将产生用户名和密码等账户信息，您可以根据本站规定改变您的密码。用户应谨慎合理的保存、使用其用户名和密码。用户若发现任何非法使用用户账号或存在安全漏洞的情况，请立即通知本站并向公安机关报案。
        </p>
        <p>
          3.4
          用户同意，全名网拥有通过邮件、短信电话等形式，向在本站注册、购物用户、收货人发送订单信息、促销活动等告知信息的权利。
        </p>
        <p>
          3.5
          用户不得将在本站注册获得的账户借给他人使用，否则用户应承担由此产生的全部责任，并与实际使用人承担连带责任。
        </p>
        <p>
          3.6
          用户同意，全名网有权使用用户的注册信息、用户名、密码等信息，登录进入用户的注册账户，进行证据保全，包括但不限于公证、见证等。
        </p>
        <p>
          3.6
          用户同意，全名网有权使用用户的注册信息、用户名、密码等信息，登录进入用户的注册账户，进行证据保全，包括但不限于公证、见证等。
        </p>
        <p>
          3.7 隐私政策
          为向您提供更准确的个性化服务，在您使用全名网产品或服务的过程中，我们可能会以如下方式收集和使用您提供的个人信息，本声明解释了这些情况下的信息收集和使用情况。全名网非常重视对您的个人隐私保护，在您使用全名网的产品及服务前，请您仔细阅读以下声明。
        </p>
        <p>
          <b>我们收集以下信息：</b>
        </p>
        <p>
          地理位置信息及目的地信息； 个人联系方式；
          包括但不限于出价、购买、物品登录、信用评价及违规记录
          其他根据具体服务的需要必要收集的信息。
          作为用户，您可根据您的意愿决定是否提供上述信息，同时，您可以查看您提供给我们的个人信息及行程信息；如果您希望删除或更正您的个人信息，请联系我们的客服人员。
        </p>
        <p>
          <b>收集资料的方法：</b>
        </p>
        <p>全名网将会收集及储存您在旗下产品客户端输入的资料，或通过其他渠道向我们提供的信息。我们亦会从关联公司、商业伙伴及其他独立第三方资料来源，获取与您有关并合法收集的个人或非个人资料；您在相关站点及其他供应商所作的隐私设定，可限制或阻止我们对有关资料的查阅；若您提供个人资料予我们，即表示您接受，全名网将在所需期限内留存您的资料以履行有关用途，您的资料将在遵守适用相关法律及规定的情况下收集。</p>
        <p>
          <b>收集个人资料可作以下用途：</b>
        </p>
        <p>
          提供全名网产品中所包含的相关服务；
          陕西全名信息科技有限公司旗下网站及APP管理；
          用户身份验证、客户服务、安全防范、诈骗监测、存档和备份用途，确保我们向您提供的产品和服务的安全性；如果我们监测到您使用我们的服务用于欺诈或非法目的，我们将会相应采取措施停止服务；
          向您推送最新的市场信息及优惠方案；
          设计全新或改善目前所提供的产品及服务； 服务内容个性化更新；
          协助执行法例、警方或其他政府或监管机构调查，以及遵守适用法律及规例所施行的规定，或其他向政府或监管机构承诺之义务；
          在收集之时所通知的其他用途；及与上述任何项目直接有关的其他用途。
        </p>
        <p>
          <b>可能向您发送的信息：</b>
        </p>
        <p>
          为保证服务完成所必须的验证码；
          使用产品或服务时所必要的推送通知；
          当前用消费金额用优惠及减免信息；
          关于全名网产品或服务的新闻、特别优惠及促销活动消息。
          信息安全及隐私保护措施。
          陕西全名信息科技有限公司及其关联公司采用严格的安全制度来确保我们收集的信息不丢失，不被滥用和变造。
          我们使用行业通行的安全技术和程序，来保护您的个人信息不被未经授权的访问、使用或泄露；
          为更好地提供服务升级产品，我们可能会将我们获得的数据提供给第三方用于分析统计。在提供服务的过程中，我们也会使用第三方的产品或服务。以上第三方企业或个人，只有在必须的情况下才会接触到用户信息，同时他们都受到严格的保密条款的约束；
          请注意，任何安全系统都存在可能的及未知的风险。全名网不会向任何人出售或出借用户的个人信息，除非事先得到用户许可。
        </p>
      </dd>
    </dl>
    <dl>
      <dt>第4条 用户依法言行义务</dt>
      <dd>
        <p>本协议依据国家相关法律法规规章制定，用户同意严格遵守以下义务：</p>
        <p>（1）不得传输或发表：煽动抗拒、破坏宪法和法律、行政法规实施的言论，煽动颠覆国家政权，推翻社会主义制度的言论，煽动分裂国家、破坏国家统一的的言论，煽动民族仇恨、民族歧视、破坏民族团结的言论；</p>
        <p>（2）从中国大陆向境外传输资料信息时必须符合中国有关法规；</p>
        <p>（3）不得利用本站从事洗钱、窃取商业秘密、窃取个人信息等违法犯罪活动；</p>
        <p>（4）不得干扰本站的正常运转，不得侵入本站及国家计算机信息系统；</p>
        <p>（5）不得传输或发表任何违法犯罪的、骚扰性的、中伤他人的、辱骂性的、恐吓性的、伤害性的、庸俗的，淫秽的、不文明的等信息资料；</p>
        <p>（6）不得传输或发表损害国家社会公共利益和涉及国家安全的信息资料或言论；</p>
        <p>（7）不得教唆他人从事本条所禁止的行为；</p>
        <p>（8）不得利用在本站注册的账户进行牟利性经营活动；</p>
        <p>（9）不得发布任何侵犯他人著作权、商标权等知识产权或合法权利的内容；</p>
        <p>
          用户应不时关注并遵守本站不时公布或修改的各类合法规则规定。
          本站保有删除站内各类不符合法律政策或不真实的信息内容而无须通知用户的权利。
          若用户未遵守以上规定的，本站有权作出独立判断并采取暂停或关闭用户帐号等措施。用户须对自己在网上的言论和行为承担法律责任。
        </p>
      </dd>
    </dl>
    <dl>
      <dt>第5条 商品信息</dt>
      <dd>
        <p>本站上的商品价格、数量、是否有货等商品信息随时都有可能发生变动，本站不作特别通知。由于网站上商品信息的数量极其庞大，虽然本站会尽最大努力保证您所浏览商品信息的准确性，但由于众所周知的互联网技术因素等客观原因存在，本站网页显示的信息可能会有一定的滞后性或差错，对此情形您知悉并理解；全名网欢迎纠错，并会视情况给予纠错者一定的奖励。为表述便利，商品和服务简称为"商品"或"货物"。</p>
      </dd>
    </dl>
    <dl>
      <dt>第6条 订单</dt>
      <dd>
        <p>
          6.1
          在您下订单时，请您仔细确认所购商品的名称、价格、数量、型号、规格、尺寸、联系地址、电话、收货人等信息。收货人与用户本人不一致的，收货人的行为和意思表示视为用户的行为和意思表示，用户应对收货人的行为及意思表示的法律后果承担连带责任。
        </p>
        <p>
          6.2
          除法律另有强制性规定外，双方约定如下：本站上销售方展示的商品和价格等信息仅仅是交易信息的发布，您下单时须填写您希望购买的商品数量、价款及支付方式、收货人、联系方式、收货地址等内容；系统生成的订单信息是计算机信息系统根据您填写的内容自动生成的数据，仅是您向销售方发出的交易诉求；销售方收到您的订单信息后，只有在销售方将您在订单中订购的商品从仓库实际直接向您发出时（
          以商品出库为标志），方视为您与销售方之间就实际直接向您发出的商品建立了交易关系；如果您在一份订单里订购了多种商品并且销售方只给您发出了部分商品时，您与销售方之间仅就实际直接向您发出的商品建立了交易关系；只有在销售方实际直接向您发出了订单中订购的其他商品时，您和销售方之间就订单中该其他已实际直接向您发出的商品才成立交易关系。您可以随时登录您在本站注册的账户，查询您的订单状态。
        </p>
        <p>
          6.3
          由于市场变化及各种以合理商业努力难以控制的因素的影响，本站无法保证您提交的订单信息中希望购买的商品都会有货；如您拟购买的商品，发生缺货，您有权取消订单。
        </p>
      </dd>
    </dl>
    <dl>
      <dt>第7条 配送</dt>
      <dd>
        <p>
          7.1
          销售方将会把商品（货物）送到您所指定的收货地址，所有在本站上列出的送货时间为参考时间，参考时间的计算是根据库存状况、正常的处理过程和送货时间、送货地点的基础上估计得出的。
        </p>
        <p>
          7.2
          因如下情况造成订单延迟或无法配送等，销售方不承担延迟配送的责任：（1）用户提供的信息错误、地址不详细等原因导致的；（2）货物送达后无人签收，导致无法配送或延迟配送的；（3）情势变更因素导致的；（4）不可抗力因素导致的，例如：信息网络设备维护、信息网络连接故障、智能终端、通讯或其他系统的故障、电力故障、罢工、劳动争议、暴乱、起义、骚乱、火灾、洪水、风暴、爆炸、战争、政府行为、司法行政机关的命令、其他不可抗力或第三方的不作为而造成的不能服务或延迟服务不承担责任。无论在任何情况下（包括但不限于疏忽原因），由于使用全名网上的信息或由全名网软件链接的信息，或其他与全名网软件链接的网站信息，对您或他人所造成任何的损失或损害（包括直接、间接、特别或后果性的损失或损害，例如收入或利润之损失，智能终端系统之损坏或数据丢失等后果），均由使用者自行承担责任（包括但不限于疏忽责任）。
        </p>
      </dd>
    </dl>
    <dl>
      <dt>第8条 所有权及知识产权条款</dt>
      <dd>
        <p>
          8.1
          用户一旦接受本协议，即表明该用户主动将其在任何时间段在本站发表的任何形式的信息内容（包括但不限于客户评价、客户咨询、各类话题文章等信息内容）的财产性权利等任何可转让的权利，如著作权财产权（包括并不限于：复制权、发行权、出租权、展览权、表演权、放映权、广播权、信息网络传播权、摄制权、改编权、翻译权、汇编权以及应当由著作权人享有的其他可转让权利），全部独家且不可撤销地转让给全名网所有，用户同意全名网有权就任何主体侵权而单独提起诉讼。
        </p>
        <p>
          8.2
          本协议已经构成《中华人民共和国著作权法》第二十五条（条文序号依照2011年版著作权法确定）及相关法律规定的著作财产权等权利转让书面协议，其效力及于用户在全名网网站上发布的任何受著作权法保护的作品内容，无论该等内容形成于本协议订立前还是本协议订立后。
        </p>
        <p>
          8.3
          用户同意并已充分了解本协议的条款，承诺不将已发表于本站的信息，以任何形式发布或授权其它主体以任何方式使用（包括但不限于在各类网站、媒体上使用）。
        </p>
        <p>
          8.4
          全名网是本站的制作者,拥有此网站内容及资源的著作权等合法权利,受国家法律保护,有权不时地对本协议及本站的内容进行修改，并在本站张贴，无须另行通知用户。在法律允许的最大限度范围内，全名网对本协议及本站内容拥有解释权。
        </p>
        <p>
          8.5
          除法律另有强制性规定外，未经全名网明确的特别书面许可,任何单位或个人不得以任何方式非法地全部或部分复制、转载、引用、链接、抓取或以其他方式使用本站的信息内容，否则，全名网有权追究其法律责任。
        </p>
        <p>
          8.6
          本站所刊登的资料信息（诸如文字、图表、标识、按钮图标、图像、声音文件片段、数字下载、数据编辑和软件），均是全名网或其内容提供者的财产，受中国和国际版权法的保护。本站上所有内容的汇编是全名网的排他财产，受中国和国际版权法的保护。本站上所有软件都是全名网或其关联公司或其软件供应商的财产，受中国和国际版权法的保护。
        </p>
      </dd>
    </dl>
    <dl>
      <dt>第9条 责任限制及不承诺担保</dt>
      <dd>
        <p>
          除非另有明确的书面说明,本站及其所包含的或以其它方式通过本站提供给您的全部信息、内容、材料、产品（包括软件）和服务，均是在"按现状"和"按现有"的基础上提供的。
          除非另有明确的书面说明,
          全名网不对本站的运营及其包含在本网站上的信息、内容、材料、产品（包括软件）或服务作任何形式的、明示或默示的声明或担保（根据中华人民共和国法律另有规定的以外）。
          全名网不担保本站所包含的或以其它方式通过本站提供给您的全部信息、内容、材料、产品（包括软件）和服务、其服务器或从本站发出的电子信件、信息没有病毒或其他有害成分。
          如因不可抗力或其它本站无法控制的原因使本站销售系统崩溃或无法正常使用导致网上交易无法完成或丢失有关的信息、记录等，全名网会合理地尽力协助处理善后事宜。
        </p>
      </dd>
    </dl>
    <dl>
      <dt>第10条 协议更新及用户关注义务</dt>
      <dd>
        <p>根据国家法律法规变化及网站运营需要，全名网有权对本协议条款不时地进行修改，修改后的协议一旦被张贴在本站上即生效，并代替原来的协议。用户可随时登录查阅最新协议；&nbsp;用户有义务不时关注并阅读最新版的协议及网站公告。如用户不同意更新后的协议，可以且应立即停止接受全名网网站依据本协议提供的服务；如用户继续使用本网站提供的服务的，即视为同意更新后的协议。全名网建议您在使用本站之前阅读本协议及本站的公告。&nbsp;如果本协议中任何一条被视为废止、无效或因任何理由不可执行，该条应视为可分的且并不影响任何其余条款的有效性和可执行性。随着全名网服务的进一步提升，隐私声明的内容会随时更新。更新后的隐私声明一旦在网页上公布即有效代替原来的隐私声明。我们鼓励您定期查看本页以了解我们对于隐私保护的最新操作。</p>
      </dd>
    </dl>
    <dl>
      <dt>第11条 法律管辖和适用</dt>
      <dd>
        <p>
          本协议的订立、执行和解释及争议的解决均应适用在中华人民共和国大陆地区适用之有效法律（但不包括其冲突法规则）。
          如发生本协议与适用之法律相抵触时，则这些条款将完全按法律规定重新解释，而其它有效条款继续有效。
          如缔约方就本协议内容或其执行发生任何争议，双方应尽力友好协商解决；协商不成时，任何一方均可向有管辖权的中华人民共和国大陆地区法院提起诉讼。
        </p>
      </dd>
    </dl>
    <dl>
      <dt>第12条 其他</dt>
      <dd>
        <p>
          12.1
          全名网网站所有者是指在政府部门依法许可或备案的全名网网站经营主体。
        </p>
        <p>
          12.2
          全名网尊重用户和消费者的合法权利，本协议及本网站上发布的各类规则、声明等其他内容，均是为了更好的、更加便利的为用户和消费者提供服务。本站欢迎用户和社会各界提出意见和建议，全名网将虚心接受并适时修改本协议及本站上的各类规则。
        </p>
        <p>
          12.3
          本协议内容中以黑体、加粗、下划线、斜体等方式显著标识的条款，请用户着重阅读。
        </p>
        <p>
          12.4
          您点击本协议下方的"好"按钮即视为您完全接受本协议，在点击之前请您再次确认已知悉并完全理解本协议的全部内容。
        </p>
      </dd>
    </dl>
  </div>
</template>
<script>
export default {
  methods: {
    imgjumpa() {
      this.$router.push("/Login");
    }
  }
};
</script>


<style lang="scss">
@function vw($px) {
  @return ($px / 750) * 100vw;
}
body {
  font-family: Helvetica, SimHei, sans-serif;
}
.close {
  width: vw(50);
  height: vw(50);
  position: absolute;
  top: vw(10);
  right: vw(20);
}
h3 {
  margin-top: vw(60);
  font-size: vw(35);
  color: #323232;
  text-align: center;
}
dl {
  margin-bottom: vw(20);
  padding: vw(20);
  border: 1px solid #ececec;
  p {
    font-size: vw(20);
    color: #696969;
  }
  dt {
    font-size: vw(30);
  }
}
</style>
